cv/kompetens_matris.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-23 Fri 06:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Kompetensmatriser</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Johan Sandén" />
</head>
<body>
<div id="content">
<h1 class="title">Kompetensmatriser</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Definitioner</a>
<ul>
<li><a href="#orgheadline1">1.1. </a></li>
<li><a href="#orgheadline2">1.2. Kunskapsnivå</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. Projek/process</a></li>
<li><a href="#orgheadline5">3. Programmerinsspråk</a></li>
<li><a href="#orgheadline6">4. Utecklingsmiljöer</a></li>
<li><a href="#orgheadline10">5. Biblotek</a>
<ul>
<li><a href="#orgheadline7">5.1. Java</a></li>
<li><a href="#orgheadline8">5.2. Python</a></li>
<li><a href="#orgheadline9">5.3. Emacs</a></li>
</ul>
</li>
<li><a href="#orgheadline11">6. Operativsystem</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Definitioner</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> </h3>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Kunskapsnivå</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li value="0">Ingen kunskap.</li>
<li>Små kunskaper.
<ul class="org-ul">
<li>Namn, definitioner, grundläggande principer.</li>
</ul></li>
<li>Vissa kunskaper.
<ul class="org-ul">
<li>Kunskap i vissa avgränsade delar.</li>
<li>Kan troligen sätta sig in i ämnet ganska lätt.</li>
<li>Har helt förstått principerna.</li>
</ul></li>
<li>Kunnig.
<ul class="org-ul">
<li>Kan de vanliga best practice.</li>
<li>De viktigate externa delarna (apier, libbar, program)</li>
<li>Kan undviker vanliga falluckor.</li>
</ul></li>
<li>Goda kunskaper.
<ul class="org-ul">
<li>Kan flera api:er</li>
<li>Best practice kunskaper</li>
<li>Har djupgående kunskaper i principer</li>
<li>Kan varianter och olika varianters styrkor</li>
</ul></li>
<li>Expert.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Projek/process</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Begrepp</th>
<th scope="col" class="org-right">Nivå</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Projektledning</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Scrum</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Kanban</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Programmerinsspråk</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Språk</th>
<th scope="col" class="org-right">Kunskapsnivå</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Python</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">ELisp</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">Bash</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">C++</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Perl</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">SQL</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Borland Pascal</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Common Lisp</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Prolog</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Utecklingsmiljöer</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Miljö</th>
<th scope="col" class="org-right">Kunskapsnivå</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Emacs</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">Eclips/STS</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Visual Studio</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Borland JBuilder</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">5</span> Biblotek</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">5.1</span> Java</h3>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">5.2</span> Python</h3>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">5.3</span> Emacs</h3>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">6</span> Operativsystem</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operativ</th>
<th scope="col" class="org-right">Kunskapsnivå</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OS X</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Linux</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">Unix</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">Android</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">iOS</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-05-09 Fri&gt;</span></span></p>
<p class="author">Author: Johan Sandén</p>
<p class="date">Created: 2018-03-23 Fri 06:30</p>
<p class="creator">Emacs 24.3.1 (Org mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
